import blurImage from "../../../public/Screenshot_4.png";
import blurImage2 from "../../../public/Screenshot_3.png";
import blurImage3 from "../../../public/Screenshot_3.png";
export const BigCardData = [
  {
    id: 1,
    image: blurImage,
    dataImage: blurImage,
    dataImage2: blurImage2,
    dataImage3: blurImage3,
    title: "Построение",
    cardTitle1: "Простой опыт работы",
    cardTitle2: "Язык по выбору",
    cardTitle3: "Инженерные практики",
    text: "Вы встречали кого-нибудь, кто говорил, что им нравится разрабатывать в Airflow? Вот почему мы разработали простой интерфейс для разработчиков, который вам понравится.",
    cardText1:
      "Начните разработку локально с помощью одной команды или запустите среду разработки в своем облаке с помощью Terraform.",
    cardText2:
      "Пишите код на Python, SQL или R в одном конвейере обработки данных для максимальной гибкости.",
    cardText3:
      "Каждый шаг в вашем конвейере представляет собой отдельный файл, содержащий модульный код, который можно использовать повторно ",
  },
  {
    id: 2,
    image: blurImage2,
    dataImage: blurImage,
    dataImage2: blurImage2,
    dataImage3: blurImage3,
    title: "просмотр",
    cardTitle1: "Интерактивный код",
    cardTitle2: "Дейта - первоклассный гражданин",
    cardTitle3: "Совместная работа в облаке",
    text: "Вы тратите время, пытаясь протестировать свои базы данных в production? Получайте мгновенную обратную связь каждый раз, когда запускаете код в разработке.",
    cardText1:
      "С помощью интерактивного пользовательского интерфейса notebook вы сразу увидите результаты вывода вашего кода.",
    cardText2:
      "Каждый блок кода в вашем конвейере создает данные, которые можно версифицировать, разбивать на разделы и каталогизировать для дальнейшего использования.",
    cardText3:
      "Совместная разработка на облачных ресурсах, контроль версий с помощью Git и конвейеры тестирования, не дожидаясь доступной среды sharedstaging.",
  },
  {
    id: 3,
    image: blurImage3,
    dataImage: blurImage,
    dataImage2: blurImage2,
    dataImage3: blurImage3,
    title: "Запуск",
    cardTitle1: "Быстрое развертывание",
    cardTitle2: "Упрощение масштабирования",
    cardTitle3: "наблюдаемость",
    text: "У вас нет большой команды, занимающейся Airflow? Mage позволяет одному разработчику легко масштабировать тысячи конвейеров и управлять ими.",
    cardText1:
      "Разверните Mage в AWS, GCP, Azure или DigitalOcean всего двумя командами, используя поддерживаемые шаблоны Terraform.",
    cardText2:
      "Преобразуйте очень большие наборы данных непосредственно в вашем хранилище данных или с помощью встроенной интеграции со Spark.",
    cardText3:
      "Вводите в эксплуатацию свои конвейеры с помощью встроенного мониторинга, оповещения и возможности наблюдения с помощью интуитивно понятного пользовательского интерфейса.",
  },
];
